// Мінімум
// 1. Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.
let result = 0.1 + 0.2;
console.log(`0.1 + 0.2 = ${+result.toFixed(2)}`);

// 2. Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.
let lineOne = '1';
let number = 2;
let addition = (lineOne + number); // рядок + число = обьєднання в рядок
console.log(addition);
console.log(typeof addition);


let a = '1';
let b = 2;

let sum = +a + b; // унарний оператор + перетворює рядок в число
console.log(sum);
console.log(typeof sum);


// 3. Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.
const FILE = 820;
let memory = prompt('Який обсяг вашої флешки?', '');
alert(`На вашу флешку поміститься ${Math.floor((memory * 1000) / FILE)} файлів/файла по 820Мб!`);




// Норма
// 1. Користувач вводить суму грошей в гаманці і ціну однієї шоколадки. Програма виводить скільки шоколадок 
// може купити користувач і скільки здачі у нього залишиться.
let amountMoney = prompt('Сума грошей в гаманці?', 0);
let priceChocolate = prompt('Ціна однієї шоколадки?', 0);
alert("Ви може купити: " + Math.floor(amountMoney / priceChocolate) + " шт.");
alert("Остаток грошей: " + (amountMoney % priceChocolate) + " грн" );


//2 Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться оператор % (залишок від ділення).
var rez=prompt("Введите число");
alert(rez.split("").reverse().join(""));

//Що повернуть вирази:
//  2 && 0 && 3 
console.log('2 && 0 && 3 = ' + (2 && 0 && 3)); // 0

//  2 || 0 || 3 
console.log('2 || 0 || 3 = ' + (2 || 0 || 3)); // 2

// 2 && 0 || 3
console.log('2 && 0 || 3 = ' + (2 && 0 || 3)); // 3